/*求解迷宫从入口到出口的一条最短路径。输入一个迷宫，求从入口通向出口的一条可行最短路径。为简化问题，
迷宫用二维数组 int maze[10][10]来存储障碍物的分布，假设迷宫的横向和纵向尺寸的大小是一样的，并由程
序运行读入, 若读入迷宫大小的值是n（3<n<=10），则该迷宫横向或纵向尺寸都是n，规定迷宫最外面的一圈是
障碍物，迷宫的入口是maze[1][1]，出口是maze[n-2][n-2], 若maze[i][j] = 1代表该位置是障碍物，
若maze[i][j] = 0代表该位置是可以行走的空位（0<=i<=n-1, 0<=j<=n-1）。求从入口maze[1][1]到
出口maze[n-2][n-2]可以走通的路径。要求迷宫中只允许在水平或上下四个方向的空位上行走，走过的位置
不能重复走，规定必须按向右、向下、向左、向上的顺序向前搜索试探，输出先到达出口的最短路径。
如下这样一个迷宫：

dddd.png

对应的二维数组表示：
int maze[10][10]={
        {1,1,1,1,1,1,1,1,1,1},
        {1,0,0,1,0,0,0,1,0,1},
        {1,0,0,1,0,0,0,1,0,1},
        {1,0,0,0,0,1,1,0,0,1},
        {1,0,1,1,1,0,0,0,1,1},
        {1,0,0,0,1,0,0,0,1,1},
        {1,0,1,0,0,0,1,0,0,1},
        {1,1,1,1,0,1,1,0,1,1},
        {1,0,0,0,0,0,0,0,0,1},
        {1,1,1,1,1,1,1,1,1,1}};

输入格式:
输入迷宫大小的整数n, 以及n行和n列的二维数组（数组元素1代表障碍物，0代表空位）。

输出格式:
输出按规定搜索试探顺序先到达出口的首条最短路径，依次输出从入口到出口可行最短路径每个位置的行列下标（i,j），
每个位置间用“,”分隔。若没有通路，输出：NO。

输入样例1:
4
1 1 1 1
1 0 1 1
1 0 0 1
1 1 1 1
输出样例1:
(1,1)(2,1)(2,2)
输入样例2:
10
1 1 1 1 1 1 1 1 1 1
1 0 0 1 0 0 0 1 0 1
1 0 0 1 0 0 0 1 0 1
1 0 0 0 0 1 1 0 0 1
1 0 1 1 1 0 0 0 0 1
1 0 0 0 1 0 0 0 0 1
1 0 1 0 0 0 1 0 0 1
1 0 1 1 1 0 1 1 0 1
1 1 0 0 0 0 0 0 0 1
1 1 1 1 1 1 1 1 1 1
输出样例2:
(1,1)(2,1)(3,1)(4,1)(5,1)(5,2)(5,3)(6,3)(6,4)(6,5)(7,5)(8,5)(8,6)(8,7)(8,8)*/



//广搜
#include<iostream>
#include<deque>
using namespace std;
#define N 100
int maze[N][N], d[N][N], n, flag;
int dx[] = { 0,1,0,-1 }, dy[] = { 1,0,-1,0 };
deque<pair<int, int>> de;
pair<int, int> p[N][N];
void bfs(int xx, int yy)
{
    de.push_back({ xx,yy });
    d[xx][yy] = 1;
    while (!de.empty())
    {
        pair<int, int> ans = de.front();
        de.pop_front();
        if (ans.first == n - 2 && ans.second == n - 2)
        {
            flag = 1;
            return;
        }
        for (int i = 0; i < 4; ++i)
        {
            int x = ans.first + dx[i], y = ans.second + dy[i];//以出栈的元素为基础进行方向变化
            if (x >= 0 && x < n && y >= 0 && y < n && maze[x][y] == 0 && !d[x][y])
            {
                d[x][y] = 1;
                de.push_back({ x,y });
                p[x][y] = ans;//连接到上一层,类似于树形
            }
        }
    }
}
void Out(pair<int, int> it)//递归输出，根据p的树形顺着找到第一个再输出
{
    if (it.first == 1 && it.second == 1)
    {
        cout << "(" << it.first << "," << it.second << ")";
        return;
    }
    Out(p[it.first][it.second]);
    cout << "(" << it.first << "," << it.second << ")";
}
int main()
{
    cin >> n;
    for (int i = 0; i < n; ++i)
        for (int j = 0; j < n; ++j)
            cin >> maze[i][j];
    bfs(1, 1);//广搜
    if (flag)
    {
        pair<int, int> end = { n - 2,n - 2 };
        Out(end);
    }
    else
    {
        cout << "NO";
    }

}